[
    {
        "fact": "`Generates a random fact for you.`",
        "pfp": "`Shows discord avatar of other users and if the member is not mentioned, then displays your discord avatar`",
        "pet": "`Generates a random image of an animal that you have mentioned in the argument.`",
        "add": "`Sums up two given numbers by the user, sum of total 8 numbers are possible.`",
        "subtract": "`Gives the user, the difference of two provided numbers. It also allows total 8 numbers for calculation.`",
        "multiply": "`Finds the product of 2 numbers and can accept total 8 numbers for calculating.`",
        "divide": "`The user needs to provide a numerator/dividend and a denominator/divisor to let the bot calculate the quotient.`",
        "exponent": "`The bot is provided with a number and some power, then the result is calculated as the exponent raised to that power.`",
        "logs": "`The most cool feature of Purrbot. This command will tell you about the updates and fixes in the bot commands according to the recent update. So, make sure you always read them out!`",
        "pick1": "`A game of choice, where the user needs to provide with two choices, and the bot will pick one of them randomly.`",
        "8ball": "`Want the bot to answer of your questions in a Yes/No? Then that's what the bot does! You just need type your question in the parameter and the bot will answer in refusal or acceptance.`",
        "diceroll": "`A simple command, which makes the bot rolls out a dice for you and show the random number obtained by it, in the range of 1, 6.`",
        "randomnum": "`User needs to give two numbers and then the bot will choose any number in that range. Though, remember that the both numbers which are given will be included in the range.`",
        "info": "`Command to know about Purrbot.`",
        "spamstart": "`One of the most used commands in Purrbot. The bot starts spamming a message for n number of times.`",
        "echo": "`Do you want to say something through Purrbot? Say and the bot will repeat everything according to it!`",
        "factorial": "`Factorial is a sequence of multiplying number as 'n x n-1 x n-2 x n-3...... x 1'. The Purrbot with advanced calculation skills, will help you calculate this sequence easily in no time!`",
        "pat": "`Roleplay command where you need to specify the user and give him/her a pat as appreciation.`",
        "slap": "`Feeling really angry on someone? Then hit them with a slap on their face!`",
        "invite": "`Gives the link to invite the user. You can either copy the link or go to that link directly to invite the bot.`",
        "rate" : "`Ever wanted to judge someone on some basis like coolness or smartness? Then let the bot know and get the percentage of it!`",
        "toss" : "`Toss is another simple command, it just toss a coin for you and tell whether you got heads/tails. But do tell, which side you want.`",
        "riddle" : "`Want to test out how smart are you? Then have a look at this command and try to solve different riddles by yourself! Also, you needn't worry if you don't know. Answers are provided as well, for you.`",
        "encode" : "`Want to turn your texts into some sort of secret passcode? Then Purrbot is here to help you do that! Also, check out the decode command for more.`",
        "decode" : "`If you are trying to solve all those Purrbot code symbols by yourself, then you needn't because this is the command that will help you solve all the problems related to it! Copy the code and use this command to get the original text!`",
        "feedback" : "`Want to tell us about your experience regarding Purrbot? Or do you have any ideas for the bot? Then this command is for you!`",
        "purge" : "`Deleted the number of messages mentioned by you. Make sure the number doesn't exceed 50, and by default, Purrbot cleares 5 messages.`",
        "kick" : "`Use this command to kick out the member who is misbehaving and breaking rules.`",
        "kaboom" : "`Want to delete channel in one click? Why not use this command, then?`",
        "wish" : "`Wish for a user using this command! We hope your wishes reach to that user and their life improves.`",
        "userinfo" : "`You can get to know about a user by using this command. Purrbot will tell when their accound was created, when they joined, about their roles and a lotta more!`",
        "serverinfo" : "`Shows the information regarding a server. If you want to find various details about a server, then this command is surely for you.`",
        "log10" : "`This command returns the log of a number that you enter, using the base as 10.`",
        "sqroot" : "`This command returns the square root of a number that is given by you.`",
        "hiddendm" : "`Want to send a dm to a user but not directly by you? Then use this command and enter your message which will be sent to the member you mentioned, by Purrbot.`",
        "shapes" : "`The most useful command of Purrbot. Just enter the shape name, the values and then it's done. Purrbot will calculate it's surface area, total area, volume, perimeter etc! All you need to do is to leave a space in between of different volumes and hope you know which shape will require how many values.`",
        "remindme" : "`Want Purrbot to remind you something later? Here, this new command does what you wished for. Just tell the bot in how many minutes or seconds you want to be reminded in, also don't forget to add 'm' for minutes and 's' for seconds. Hour is not available but you can use minutes which can be a subsitute for hours.`",
        "poll" : "`Remember the older version of Purrbot where admins used the poll command for some opinions? This advanced version of poll commands let's you enter a heading, footer, content and you can even add which emojis should Purrbot use for reactions! Isn't it amazing? Though, don't forget that you will have to tell the members, which emoji means what if there are multiple options (emojis) to choose.`",
        "profile" : "`This command lets you create a profile in Purrbot! You can have an image in your profile and even a custom color for your embed!`",
        "edit" : "Used to change your details in Purrbot database which is used to reflect on your profile.",
        "dailylogin" : "This command is used to login and earn some rewards!",
        "leaderboard" : "Check out the top players of Purrbot!",
        "search" : "This command is for getting some Purrcoins. It's upon your luck if you can find some coins.",
        "steal" : "Another way of earning purrcoins. Risky way but you can earn a good amount of purrcoins and can lose them too.",
        "research" : "Use this command to upgrade you fish level or daily level. It has a cooldown of 15 minutes though.",
        "shop" : "This command is used to check out available items in the shop.",
        "buy" : "Buy an item using it's ID and quantity. Default quantity is 1.",
        "inventory" : "Check your inventory for your belongings.",
        "use" : "Use an item from your inventory.",
        "share" : "Share some purrcoins with someone else.",
        "gamble" : "Quite addictive but a handy way to earn money fast. 50% CHANCE for success.",
        "fish" : "Catch some fishes either for collection or for selling.",
        "bucket" : "Inventory to find how many fishes you have.",
        "sellfish" : "Sell your fishes to earn purrcoins!",
        "fishinfo" : "Get information about a fish type.",
        "item" : "Find some information about certain items!",
        "balance" : "Check your balance.",
        "counter" : "Displays the number of times you have used a roleplay command."
    },
    {
        "toss": "side --> To tell whether you want heads or tails.",
        "rate":
        "member --> Mention the member to perform action on\narg --> the quality on which you want to rate the member.",
        "invite": "No arguments to fulfill.",
        "slap" : "member --> Mention the member to perform action on", 
        "pat" : "member --> Mention the member to perform action on",
        "pfp" : "`optional` member --> Mention the member to perform action on",
        "factorial" : "num --> Number on which the command should be performed",
        "echo" : "msg --> Any sentence of word",
        "spamstart" : "message --> Any sentence or word\n`optional`amount --> Integer, for repition. 50, if not entered.",
        "info" : "No arguments to fulfill.",
        "randomnum" : "startnum --> Any positive number to start range with\nendnum --> Any positive number to end the range",
        "diceroll" : "No arguments to fulfill.",
        "pick1" : "option1 --> Choice 1 to choose from\noption2 --> Choice 2 to choose from.",
        "8ball" : "question --> Type the question you want to get answer for.",
        "logs" : "No arguments to fulfill.",
        "exponent" : "num --> Number on which the command should be performed\npower --> integer, at which the number will be raised.",
        "fact" : "No arguments to fulfill.",
        "add" : "num1 --> Number 1 to perform action\nnum2 --> Number 2 to perform action\n`optional` num3 --> Number 3 to perform action\n`optional` num4 --> Number 4 to perform action\n`optional` num5 --> Number 5 to perform action\n`optional` num6 --> Number 6 to perform action\n`optional` num7 --> Number 7 to perform action\n`optional` num8 --> Number 8 to perform action\n",
        "multiply" : "num1 --> Number 1 to perform action\nnum2 --> Number 2 to perform action\n`optional` num3 --> Number 3 to perform action\n`optional` num4 --> Number 4 to perform action\n`optional` num5 --> Number 5 to perform action\n`optional` num6 --> Number 6 to perform action\n`optional` num7 --> Number 7 to perform action\n`optional` num8 --> Number 8 to perform action",
        "subtract" : "num1 --> Number 1 to perform action\nnum2 --> Number 2 to perform action\n`optional` num3 --> Number 3 to perform action\n`optional` num4 --> Number 4 to perform action\n`optional` num5 --> Number 5 to perform action\n`optional` num6 --> Number 6 to perform action\n`optional` num7 --> Number 7 to perform action\n`optional` num8 --> Number 8 to perform action",
        "divide" : "numerator --> Number which will act as dividend\ndenominator --> Number which will act as divisor",
        "pet" : "pets --> Animal to be chosen from the given options.",
        "riddle" : "No arguments to fulfill.",
        "encode" : "text --> Any sentence/word",
        "decode" : "code --> symbols that are used to encode",
        "feedback" : "No arguments to fulfill.",
        "purge" : "`optional` number --> Any natural number. 5 is default",
        "kick" : "member --> Mention the member to perform action on\n`optional`reason --> the main reason due to which the action has been taken",
        "kaboom" : "channel --> Mention the channel on which the action has to be performed",
        "hiddendm" : "member --> Mention the member to perform action on\nmessage --> Any sentence or word",
        "shape" : "shape --> Select the 2D/3D shape from the options to perform action\nvalue --> Enter the numbers to use for the action or with spaces if entering more values",
        "sqroot" : "num --> Number on which the command should be performed on",
        "log10" : "num --> Number on which the command should be performed on",
        "userinfo" : "`optional`member --> Mention the member to perform action on",
        "serverinfo" : "No arguments to fulfill.",
        "wish" : "member --> Mention the member to perform action on\n`optional`reason --> the main reason due to which the action has been taken",
        "remindme" : "message --> Any sentence or word\ntime --> Time in minutes (m) or seconds (s) placed at the end. For example : 4s, 23m, 2m, 90s, etc.",
        "poll" : "content --> Any sentence defining the purpose of something\nemojis --> Enter emojis that you want Purrbot to add as reaction\n`optional` header --> Heading\n`footer` --> Footer (text at the bottom)",
        "profile" : "member --> Mention the member to perform action on",
        "edit" : "val --> Add a new value to the existing value",
        "leaderboard" : "basis --> Enter the basis to get the leaderboard",
        "search" : "No arguments to fulfill.",
        "steal" : "No arguments to fulfill.",
        "research" : "leveltype --> Enter to whether upgrade fish or daily level",
        "shop" : "No arguments to fulfill.",
        "buy" : "itemid --> ID of the item\n`optional` quantity --> Quantity of the item to buy",
        "inventory" : "No arguments to fulfill.",
        "share" : "member --> Mention the member to perform action on\namount --> Amount of purrcoins to be shared",
        "gamble" : "amount --> Amount of purrcoins to gamble",
        "fish" : "No arguments to fulfill.",
        "bucket" : "No arguments to fulfill.",
        "sellfish" : "tier --> Enter the tier of fish to sell or to sell all",
        "fishinfo" : "tier --> Enter the tier of fish to sell or to sell all",
        "item" : "item --> ID of the item",
        "balance" : "No arguments to fulfill.",
        "counter" : "val --> Enter the roleplay command to be counted"
      }
]